In [2]:
import pandas as pd
import numpy as np
import json

In [3]:
path = 'data/Netflix_raw/combined_data_1.txt'

def combined_to_list(path):
    with open(path, 'r') as raw:
        text = raw.readlines()
    res = []
    k = []
    for line in text:
        if ':' not in line:
            res.append(k + line.strip('\n').split(','))
        else:
            k = [line.strip(':\n')]
    return res

def combined_to_csv(path, num=0):
    lista = combined_to_list(path)
    df = pd.DataFrame(lista, columns=['netflix_id', 'user_id', 'rating', 'date'])
    df.to_csv(f'data/Net_combined_{num}.csv')
    return df

In [4]:
combined_to_csv('data/Netflix_raw/combined_data_4.txt', num=4)

         netflix_id  user_id rating        date
0             13368  2385003      4  2004-07-08
1             13368   659432      3  2005-03-16
2             13368   751812      2  2002-12-16
3             13368  2625420      2  2004-05-25
4             13368  1650301      1  2005-08-30
...             ...      ...    ...         ...
26847518      17770  1790158      4  2005-11-01
26847519      17770  1608708      3  2005-07-19
26847520      17770   234275      1  2004-08-07
26847521      17770   255278      4  2004-05-28
26847522      17770   453585      2  2005-03-10

[26847523 rows x 4 columns]

In [ ]:
def float_to_object(x):
    """Transform a float into a string without decimals. Else returns variable.
    """
    try:
        return str(int(x))
    except ValueError:
        return x

def get_imdb_ids(net_path, imdb_path, save=False):
    """ Function which finds the IMDb ID of the titles from the Netflix Movie Data.
        - Args:
            - net_path: filepath of the netflix movie list.
            - imdb_path: filepath of the IMDB ID list.
            - save: Option of saving DataFrame into a .csv file.
        - Returns:
            - Dataframe.
    """
    net_movies = pd.read_csv(net_path, names=['netflix_id', 'startYear', 'originalTitle'])
    net_movies['startYear'] = net_movies['startYear'].apply(float_to_object)

    imdb_df = pd.read_csv(imdb_path, sep='\t', low_memory=False)

    net_data = pd.merge(net_movies, imdb_df, on=['originalTitle', 'startYear'])
    net_data.rename(columns={'tconst':'titleId'}, inplace=True)
    net_data.drop_duplicates('originalTitle', inplace=True)
    if save == True:
        net_data.to_csv('data/Net_Data_ID.csv')

    return net_data

In [17]:
net_movies = pd.read_csv('data/Netflix_raw/movie_titles.csv', names=['netflix_id', 'startYear', 'originalTitle'])
net_movies.head(10)

   netflix_id  startYear                 originalTitle
0           1     2003.0               Dinosaur Planet
1           2     2004.0    Isle of Man TT 2004 Review
2           3     1997.0                     Character
3           4     1994.0  Paula Abdul's Get Up & Dance
4           5     2004.0      The Rise and Fall of ECW
5           6     1997.0                          Sick
6           7     1992.0                         8 Man
7           8     2004.0    What the #$*! Do We Know!?
8           9     1991.0      Class of Nuke 'Em High 2
9          10     2001.0                       Fighter

In [18]:
len(net_movies)

17770

In [33]:
def float_to_object(x):
    try:
        return str(int(x))
    except ValueError:
        return x

In [36]:
net_movies['startYear'] = net_movies['startYear'].apply(float_to_object)
net_movies.dtypes

netflix_id        int64
startYear        object
originalTitle    object
dtype: object

In [14]:
types = pd.read_csv('data/types.tsv', sep='\t', low_memory=False)
types.head(10)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,\N,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,\N,1,"Short,Sport"
7,tt0000008,short,Edison Kinetoscopic Record of a Sneeze,Edison Kinetoscopic Record of a Sneeze,0,1894,\N,1,"Documentary,Short"
8,tt0000009,short,Miss Jerry,Miss Jerry,0,1894,\N,40,"Romance,Short"
9,tt0000010,short,Leaving the Factory,La sortie de l'usine Lumière à Lyon,0,1895,\N,1,"Documentary,Short"

In [37]:
net_data = pd.merge(net_movies, types, on=['originalTitle', 'startYear'])
net_data

,netflix_id,startYear,originalTitle,tconst,titleType,primaryTitle,isAdult,endYear,runtimeMinutes,genres
0,1,2003,Dinosaur Planet,tt0389605,tvMiniSeries,Dinosaur Planet,0,\N,50,"Animation,Documentary,Family"
1,12,1947,My Favorite Brunette,tt0039645,movie,My Favorite Brunette,0,\N,87,"Comedy,Crime,Mystery"
2,15,1988,Neil Diamond: Greatest Hits Live,tt0168093,video,Neil Diamond: Greatest Hits Live,0,\N,60,"Documentary,Music"
3,17,2005,7 Seconds,tt0417395,video,7 Seconds,0,\N,96,"Action,Comedy,Crime"
4,18,1994,Immortal Beloved,tt0110116,movie,Immortal Beloved,0,\N,121,"Biography,Drama,Music"
...,...,...,...,...,...,...,...,...,...,...
9726,17762,1997,Gattaca,tt0119177,movie,Gattaca,0,\N,106,"Drama,Sci-Fi,Thriller"
9727,17763,1978,Interiors,tt0077742,movie,Interiors,0,\N,92,Drama
9728,17764,1998,Shakespeare in Love,tt0138097,movie,Shakespeare in Love,0,\N,123,"Comedy,Drama,History"
9729,17769,2003,The Company,tt0335013,movie,The Company,0,\N,112,"Drama,Music,Romance"
9730,17770,2003,Alien Hunter,tt0327409,movie,Alien Hunter,0,\N,92,"Action,Adventure,Sci-Fi"

In [38]:
net_data.rename(columns={'tconst':'titleId'}, inplace=True)

In [21]:
net_data.head(10)

,netflix_id,startYear_x,originalTitle,titleId,titleType,primaryTitle,isAdult,startYear_y,endYear,runtimeMinutes,genres
0,1,2003.0,Dinosaur Planet,tt0389605,tvMiniSeries,Dinosaur Planet,0,2003,\N,50,"Animation,Documentary,Family"
1,3,1997.0,Character,tt11107306,tvEpisode,Character,0,2019,\N,30,Documentary
2,3,1997.0,Character,tt11422690,short,Character,0,2020,\N,17,Short
3,3,1997.0,Character,tt13328316,tvEpisode,Character,0,2020,\N,\N,Reality-TV
4,3,1997.0,Character,tt14118266,movie,Character,0,2021,\N,\N,"Crime,Horror,Thriller"
5,3,1997.0,Character,tt2245354,tvSeries,Character,0,2012,\N,\N,Comedy
6,3,1997.0,Character,tt2989400,short,Character,0,2013,\N,25,"Comedy,Drama,Romance"
7,3,1997.0,Character,tt3037246,short,Character,0,2013,\N,20,"Comedy,Short"
8,3,1997.0,Character,tt3362034,short,Character,0,2002,\N,9,"Documentary,Music,Short"
9,3,1997.0,Character,tt3816308,short,Character,0,2015,\N,14,"Drama,Fantasy,Short"

In [23]:
net_data.drop_duplicates('originalTitle', inplace=True)
net_data

,netflix_id,startYear_x,originalTitle,titleId,titleType,primaryTitle,isAdult,startYear_y,endYear,runtimeMinutes,genres
0,1,2003.0,Dinosaur Planet,tt0389605,tvMiniSeries,Dinosaur Planet,0,2003,\N,50,"Animation,Documentary,Family"
1,3,1997.0,Character,tt11107306,tvEpisode,Character,0,2019,\N,30,Documentary
18,6,1997.0,Sick,tt0574077,tvEpisode,Sick,0,2004,\N,44,Drama
96,10,2001.0,Fighter,tt0263338,movie,Fighter,0,2000,\N,91,Documentary
135,12,1947.0,My Favorite Brunette,tt0039645,movie,My Favorite Brunette,0,1947,\N,87,"Comedy,Crime,Mystery"
...,...,...,...,...,...,...,...,...,...,...,...
143993,17764,1998.0,Shakespeare in Love,tt0138097,movie,Shakespeare in Love,0,1998,\N,123,"Comedy,Drama,History"
143996,17765,1969.0,Godzilla's Revenge,tt14083430,tvEpisode,Godzilla's Revenge,0,1973,\N,\N,Horror
144000,17768,2000.0,Epoch,tt0233657,tvMovie,Epoch,0,2001,\N,96,"Sci-Fi,Thriller"
144011,17769,2003.0,The Company,tt0120938,tvSeries,The Company,0,1989,\N,\N,\N
144029,17770,2003.0,Alien Hunter,tt0289796,tvSeries,Alien Hunter,0,2001,\N,\N,"Action,Adventure,Comedy"

In [39]:
net_data.to_csv('data/Net_Data_ID.csv')

In [5]:
c1 = pd.read_csv('data/Netflix Combined/Net_combined_1.csv')
c2 = pd.read_csv('data/Netflix Combined/Net_combined_2.csv')
c3 = pd.read_csv('data/Netflix Combined/Net_combined_3.csv')
c4 = pd.read_csv('data/Netflix Combined/Net_combined_4.csv')

In [38]:
c = [c1, c2, c3, c4]
df = pd.concat(c)

In [39]:
df.to_csv('data/Netflix_Comb_Data.csv')

In [40]:
df.head(1)

   Unnamed: 0  netflix_id  user_id  rating        date
0           0           1  1488844       3  2005-09-06

In [41]:
df.rating = df.rating.apply(lambda x: x*2)

In [42]:
content = df.groupby('netflix_id').agg({'rating':'mean', 'user_id': 'count'})

In [50]:
content = content.rename(columns={'rating':'netflix_rating', 'Number of votes':'number_of_votes'})

In [52]:
content.head(1)

            netflix_rating  number_of_votes
netflix_id
1                 7.499086              547

In [19]:
net_movies = pd.read_csv('data/Netflix_raw/movie_titles.csv', names=['netflix_id', 'startYear', 'Title'])

In [53]:
df = pd.merge(content, net_movies.loc[:, ['netflix_id', 'Title']], on='netflix_id')

In [54]:
df

,netflix_id,netflix_rating,number_of_votes,Title
0,1,7.499086,547,Dinosaur Planet
1,2,7.117241,145,Isle of Man TT 2004 Review
2,3,7.282306,2012,Character
3,4,5.478873,142,Paula Abdul's Get Up & Dance
4,5,7.838596,1140,The Rise and Fall of ECW
...,...,...,...,...
17765,17766,6.386777,605,Where the Wild Things Are and Other Maurice Se...
17766,17767,7.343137,204,Fidel Castro: American Experience
17767,17768,5.678414,1362,Epoch
17768,17769,4.997185,6749,The Company
17769,17770,5.633008,921,Alien Hunter

In [55]:
df.to_csv('data/Net_title_ratings.csv')